/** 
 * @file   	HPT_hard_prog_tact.h
 * @author 	
 * @version	
 * @date 	26 сент. 2018 г.
 * @brief
 */


#ifndef HPT_HARD_PROG_TACT_H_
#define HPT_HARD_PROG_TACT_H_


/*#### |Begin| --> Секция - "Include" ########################################*/
/*==== |Begin| --> Секция - "C libraries" ====================================*/
#include "stdint.h"
/*==== |End  | <-- Секция - "C libraries" ====================================*/

/*==== |Begin| --> Секция - "MK peripheral libraries" ========================*/
#include "stm32f1xx.h"
#include "stm32f1xx_ll_tim.h"
#include "stm32f1xx_ll_rcc.h"
/*==== |End  | <-- Секция - "MK peripheral libraries" ========================*/

/*==== |Begin| --> Секция - "Extern libraries" ===============================*/
/*==== |End  | <-- Секция - "Extern libraries" ===============================*/
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Определение констант" ###########################*/
/*#### |End  | <-- Секция - "Определение констант" ###########################*/


/*#### |Begin| --> Секция - "Определение типов" ##############################*/
typedef struct
{
	/* Флаг начала нового программного цикла */
	size_t newProgTactEn_flag;

	/* Флаг не равен нулю когда цикл не уложился в отведенный промежуток времени */
	size_t progTactOverrun_flag;

	/* Флаг окончания программного цикла.
	 * Данный флаг должен сбрасываться программно после завершения каждой итерации бесконечного цикла */
	size_t progTactEnd_flag;

	/* Остаток времени после выполнения всего цикла (в тиках аппаратного счетчика) */
	size_t restProgTactCnt;
} hpt_hard_programm_tact_status_s;
/*#### |End  | <-- Секция - "Определение типов" ##############################*/


/*#### |Begin| --> Секция - "Определение глобальных переменных" ##############*/
extern hpt_hard_programm_tact_status_s HPT_status_s;
/*#### |End  | <-- Секция - "Определение глобальных переменных" ##############*/


/*#### |Begin| --> Секция - "Прототипы глобальных функций" ###################*/
extern void
HPT_InitTIMForProgTact(
	uint32_t ovefrlowVal);
/*#### |End  | <-- Секция - "Прототипы глобальных функций" ###################*/


/*#### |Begin| --> Секция - "Определение макросов" ###########################*/
/*#### |End  | <-- Секция - "Определение макросов" ###########################*/

#endif	/* HPT_HARD_PROG_TACT_H_ */

/*############################################################################*/
/*################################ END OF FILE ###############################*/
/*############################################################################*/
