/** 
 * @file   	main.c
 * @author 	m.isaev
 * @version	
 * @date 	24 сент. 2018 г.
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "main.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
int main(
	void)
{
	/*=== |Begin| --> Секция - "Конфигурирование периферии микроконтроллера" =*/

	/* Конфигурирование тактового генератора */
	LL_RCC_Init_HSE_8MHz_HCLK_72MHz();

	/* Конфигурирование портов ввода/вывода для управления светодиодами,
	 * установленными на плате */
	BLEDS_Init_AllLeds();

	/* Конфигурирование модуля USART 2 для передачи отладочной информации */
	UFD_Init_All_USART2_TxRx_DMA1_Channel7_IO_Ports(
		9600u);

	HPT_InitTIMForProgTact(
		10000u);

	/*=== |End  | <-- Секция - "Конфигурирование периферии микроконтроллера" =*/
	while(1)
	{
//		if (HPT_status_s.newProgTactEn_flag != 0)
//		{
			HPT_status_s.newProgTactEn_flag = 0;
		BLEDS_Green_ON();
		LL_USART_TransmitData8(USART2, 0xAA);

		BLEDS_Green_OFF();
//		}
	}
	return 1;
}
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
